#pragma once
#include "../../../include/stdafx.h"
#include "CRC.h"

#include "buf.h"
#include "UtlVector.h"
#include"UtlBuffer.h"
#include "IMaterialSystem.h"
#include "IVModelRender.h"

enum ButtonCode_t;
struct ScreenFade_t;
enum ClientFrameStage_t;
typedef unsigned long CRC32_t;
typedef struct player_info_s player_info_t;
struct client_textmessage_t;
typedef struct D3DMATRIXG D3DMATRIXG, *LPD3DMATRIXG;
class ClientClass;
enum ShouldTransmitState_t;
enum DataUpdateType_t;
class IClientNetworkable;
class IClientRenderable;
using CBaseHandle = unsigned long;
struct model_t;
struct spritedata_t;
struct brushdata_t;
struct Ray_t;
struct ModelRenderInfo_t;
struct mstudiobbox_t;
struct mstudiohitboxset_t;
struct mstudiobone_t;
struct studiohdr_t;
struct studiomeshdata_t;
struct studioloddata_t;
struct studiohwdata_t;
struct DrawModelState_t;
struct StaticPropRenderInfo_t;
struct cplane_t;
class ICvar;
class CRender;
enum SendPropType;
class DVariant;
class CRecvProxyData;
class CStandardRecvProxies;
enum netadrtype_t;
typedef struct netadr_s netadr_t;
struct CameraThirdData_t;
class CUserCmd;
struct kbutton_t;
class IEngineSound;

class INetChannel;
class INetMessage;
class INetChannelHandler;
class INetChannelInfo;
class IClientTools;
class IClientUnknown;
class IVModelInfo;
extern IVModelInfo *g_pVModelInfo;
//-----------------------------------------------------------------------------
// Handles to a client shadow

typedef unsigned short ClientShadowHandle_t;
//-----------------------------------------------------------------------------
// Handle to an renderable in the client leaf system
//-----------------------------------------------------------------------------
typedef unsigned short ClientRenderHandle_t;
//-----------------------------------------------------------------------------
// What kind of shadows to render?
//-----------------------------------------------------------------------------
enum ShadowType_t
{
	SHADOWS_NONE = 0,
	SHADOWS_SIMPLE,
	SHADOWS_RENDER_TO_TEXTURE,
	SHADOWS_RENDER_TO_TEXTURE_DYNAMIC,	// the shadow is always changing state
	SHADOWS_RENDER_TO_DEPTH_TEXTURE,
};

class RecvProp;
class RecvTable;
class CRecvDecoder;

typedef IClientNetworkable*	(*CreateClientClassFn)(int entnum, int serialNum);
typedef IClientNetworkable*	(*CreateEventFn)();
typedef void(*RecvVarProxyFn)(const CRecvProxyData *pData, void *pStruct, void *pOut);
typedef void(*ArrayLengthRecvProxyFn)(void *pStruct, int objectID, int currentArrayLength);
typedef void(*DataTableRecvVarProxyFn)(const RecvProp *pProp, void **pOut, void *pData, int objectID);


class IVEngineClient;
class IBaseClientDLL;
class INetChannel;
class IClientEntityList;
class CInput;
class ClientModeShared;
class IVModelRender;
class IVModelInfo;
class IVDebugOverlay;
class IEngineTrace;
class IShaderAPI;
class IVRenderView;
class IViewRender;
class IPlayerInfoManager;
class CGlobalVars;
class IPrediction;
class IGameMovement;
class IMoveHelper;
class Lua_Shared;
class ILuaInterface;
class IPanel;
class IMaterialSystem;
class IStudioRender;
class CClientState;
class IPredictableList;
class CGameTrace;
class CEngineVGui;
class ISurface;
class IInputSystem;
class IPhysicsSurfaceProps;

typedef CGameTrace trace_t;

typedef void* (*CreateInterfaceFn)(const char *pName, int *pReturnCode);
class IClientEntity;
#define IN_ATTACK		(1 << 0)
#define IN_JUMP			(1 << 1)
#define IN_DUCK			(1 << 2)
#define IN_FORWARD		(1 << 3)
#define IN_BACK			(1 << 4)
#define IN_USE			(1 << 5)
#define IN_CANCEL		(1 << 6)
#define IN_LEFT			(1 << 7)
#define IN_RIGHT		(1 << 8)
#define IN_MOVELEFT		(1 << 9)
#define IN_MOVERIGHT	(1 << 10)
#define IN_ATTACK2		(1 << 11)
#define IN_RUN			(1 << 12)
#define IN_RELOAD		(1 << 13)
#define IN_ALT1			(1 << 14)
#define IN_ALT2			(1 << 15)
#define IN_SCORE		(1 << 16)   // Used by client.dll for when scoreboard is held down
#define IN_SPEED		(1 << 17)	// Player is holding the speed key
#define IN_WALK			(1 << 18)	// Player holding walk key
#define IN_ZOOM			(1 << 19)	// Zoom key for HUD zoom
#define IN_WEAPON1		(1 << 20)	// weapon defines these bits
#define IN_WEAPON2		(1 << 21)	// weapon defines these bits
#define IN_BULLRUSH		(1 << 22)
#define IN_GRENADE1		(1 << 23)	// grenade 1
#define IN_GRENADE2		(1 << 24)	// grenade 2
#define	IN_LOOKSPIN		(1 << 25)

typedef unsigned int			uint;
typedef unsigned char			uint8;
typedef unsigned __int32		uint32;
typedef __int64					int64;
typedef unsigned __int64		uint64;
struct CameraThirdData_t
{
	float	m_flPitch;
	float	m_flYaw;
	float	m_flDist;
	float	m_flLag;
	Vector	m_vecHullMin;
	Vector	m_vecHullMax;
};


class CUserCmd
{
public:
	CUserCmd()
	{
		Reset();
	}

	//	virtual ~CUserCmd() { };

	void Reset()
	{
		command_number = 0;
		tick_count = 0;
		viewangles.Init();
		forwardmove = 0.0f;
		sidemove = 0.0f;
		upmove = 0.0f;
		buttons = 0;
		impulse = 0;
		weaponselect = 0;
		weaponsubtype = 0;
		random_seed = 0;
		mousedx = 0;
		mousedy = 0;

		hasbeenpredicted = false;
	}

	CUserCmd& operator =(const CUserCmd& src)
	{
		if (this == &src)
			return *this;

		command_number = src.command_number;
		tick_count = src.tick_count;
		viewangles = src.viewangles;
		forwardmove = src.forwardmove;
		sidemove = src.sidemove;
		upmove = src.upmove;
		buttons = src.buttons;
		impulse = src.impulse;
		weaponselect = src.weaponselect;
		weaponsubtype = src.weaponsubtype;
		random_seed = src.random_seed;
		mousedx = src.mousedx;
		mousedy = src.mousedy;

		hasbeenpredicted = src.hasbeenpredicted;

		return *this;
	}

	CUserCmd(const CUserCmd& src)
	{
		*this = src;
	}
	CRC32_t GetChecksum(void) const {
		CRC32_t crc;
		CRC32_Init(&crc);

		CRC32_ProcessBuffer(&crc, &command_number, sizeof(command_number));
		CRC32_ProcessBuffer(&crc, &tick_count, sizeof(tick_count));
		CRC32_ProcessBuffer(&crc, &viewangles, sizeof(viewangles));
		CRC32_ProcessBuffer(&crc, &forwardmove, sizeof(forwardmove));
		CRC32_ProcessBuffer(&crc, &sidemove, sizeof(sidemove));
		CRC32_ProcessBuffer(&crc, &upmove, sizeof(upmove));
		CRC32_ProcessBuffer(&crc, &buttons, sizeof(buttons));
		CRC32_ProcessBuffer(&crc, &impulse, sizeof(impulse));
		CRC32_ProcessBuffer(&crc, &weaponselect, sizeof(weaponselect));
		CRC32_ProcessBuffer(&crc, &weaponsubtype, sizeof(weaponsubtype));
		CRC32_ProcessBuffer(&crc, &random_seed, sizeof(random_seed));
		CRC32_ProcessBuffer(&crc, &mousedx, sizeof(mousedx));
		CRC32_ProcessBuffer(&crc, &mousedy, sizeof(mousedy));
		CRC32_Final(&crc);
		return crc;
	}

	// For matching server and client commands for debugging
	int		command_number;

	// the tick the client created this command
	int		tick_count;

	// Player instantaneous view angles.
	QAngle	viewangles;
	// Intended velocities
	//	forward velocity.
	float	forwardmove;
	//  sideways velocity.
	float	sidemove;
	//  upward velocity.
	float	upmove;
	// Attack button states
	int		buttons;
	// Impulse command issued.
	unsigned char impulse;
	// Current weapon id
	int		weaponselect;
	int		weaponsubtype;

	int		random_seed;	// For shared random functions

	short	mousedx;		// mouse accum in x from create move
	short	mousedy;		// mouse accum in y from create move

							// Client only, tracks whether we've predicted this command at least once
	bool	hasbeenpredicted;
	//288
	char _0x0000[288];


};
class CVerifiedUserCmd
{
public:

	CUserCmd  m_cmd;
	CRC32_t   m_crc;
};


struct kbutton_t
{
	// key nums holding it down
	int		down[2];
	// low bit is down state
	int		state;
};

enum ID_ClientClass {
	ID_CTestTraceline = 197,
	ID_CTEWorldDecal = 198,
	ID_CTESpriteSpray = 195,
	ID_CTESprite = 194,
	ID_CTESparks = 193,
	ID_CTESmoke = 192,
	ID_CTEShowLine = 190,
	ID_CTEProjectedDecal = 188,
	ID_CTEPlayerDecal = 187,
	ID_CTEPhysicsProp = 185,
	ID_CTEParticleSystem = 184,
	ID_CTEMuzzleFlash = 183,
	ID_CTELargeFunnel = 181,
	ID_CTEKillPlayerAttachments = 180,
	ID_CTEImpact = 179,
	ID_CTEGlowSprite = 177,
	ID_CTEShatterSurface = 189,
	ID_CTEFootprintDecal = 175,
	ID_CTEFizz = 174,
	ID_CTEExplosion = 173,
	ID_CTEEnergySplash = 172,
	ID_CTEEffectDispatch = 171,
	ID_CTEDynamicLight = 170,
	ID_CTEDecal = 168,
	ID_CTEClientProjectile = 166,
	ID_CTEBubbleTrail = 165,
	ID_CTEBubbles = 164,
	ID_CTEBSPDecal = 163,
	ID_CTEBreakModel = 162,
	ID_CTEBloodStream = 161,
	ID_CTEBloodSprite = 160,
	ID_CTEBeamSpline = 159,
	ID_CTEBeamRingPoint = 158,
	ID_CTEBeamRing = 157,
	ID_CTEBeamPoints = 156,
	ID_CTEBeamLaser = 155,
	ID_CTEBeamFollow = 154,
	ID_CTEBeamEnts = 153,
	ID_CTEBeamEntPoint = 152,
	ID_CTEBaseBeam = 151,
	ID_CTEArmorRicochet = 150,
	ID_CTEMetalSparks = 182,
	ID_CSteamJet = 146,
	ID_CSmokeStack = 141,
	ID_DustTrail = 230,
	ID_CFireTrail = 59,
	ID_SporeTrail = 237,
	ID_SporeExplosion = 236,
	ID_RocketTrail = 234,
	ID_SmokeTrail = 235,
	ID_CPropVehicleDriveable = 127,
	ID_ParticleSmokeGrenade = 233,
	ID_CParticleFire = 104,
	ID_MovieExplosion = 231,
	ID_CTEGaussExplosion = 176,
	ID_CEnvQuadraticBeam = 52,
	ID_CEmbers = 44,
	ID_CEnvWind = 57,
	ID_CPrecipitation = 118,
	ID_CBaseTempEntity = 30,
	ID_NextBotCombatCharacter = 232,
	ID_CWeaponStunStick = 227,
	ID_CWeaponSMG1 = 226,
	ID_CWeapon_SLAM = 206,
	ID_CWeaponShotgun = 225,
	ID_CWeaponRPG = 224,
	ID_CLaserDot = 90,
	ID_CWeaponPistol = 223,
	ID_CWeaponPhysCannon = 221,
	ID_CBaseHL2MPCombatWeapon = 24,
	ID_CBaseHL2MPBludgeonWeapon = 23,
	ID_CHL2MPMachineGun = 82,
	ID_CWeaponHL2MPBase = 219,
	ID_CWeaponFrag = 217,
	ID_CWeaponCrowbar = 214,
	ID_CWeaponCrossbow = 213,
	ID_CWeaponAR2 = 209,
	ID_CWeapon357 = 205,
	ID_CHL2MPGameRulesProxy = 81,
	ID_CTEHL2MPFireBullets = 178,
	ID_CTEPlayerAnimEvent = 186,
	ID_CHL2MPRagdoll = 83,
	ID_CHL2MP_Player = 80,
	ID_CCrossbowBolt = 41,
	ID_CWeaponHopwire = 0,
	ID_CWeaponOldManHarpoon = 220,
	ID_CWeaponCitizenSuitcase = 212,
	ID_CWeaponCitizenPackage = 211,
	ID_CWeaponAlyxGun = 207,
	ID_CWeaponCubemap = 215,
	ID_CWeaponGaussGun = 0,
	ID_CWeaponAnnabelle = 208,
	ID_CFlaregun = 0,
	ID_CWeaponBugBait = 210,
	ID_CWeaponBinoculars = 0,
	ID_CWeaponCycler = 216,
	ID_CVortigauntEffectDispel = 201,
	ID_CVortigauntChargeToken = 200,
	ID_CNPC_Vortigaunt = 103,
	ID_CPropVehiclePrisonerPod = 128,
	ID_CPropCrane = 122,
	ID_CPropCannon = 0,
	ID_CPropAirboat = 120,
	ID_CFlare = 61,
	ID_CTEConcussiveExplosion = 167,
	ID_CNPC_Strider = 102,
	ID_CScriptIntro = 135,
	ID_CRotorWashEmitter = 133,
	ID_CPropCombineBall = 121,
	ID_CPlasmaBeamNode = 0,
	ID_CNPC_RollerMine = 101,
	ID_CNPC_Manhack = 99,
	ID_CNPC_CombineGunship = 98,
	ID_CNPC_AntlionGuard = 95,
	ID_CInfoTeleporterCountdown = 89,
	ID_CMortarShell = 94,
	ID_CEnvStarfield = 55,
	ID_CEnvHeadcrabCanister = 49,
	ID_CAlyxEmpEffect = 11,
	ID_CCorpse = 40,
	ID_CCitadelEnergyCore = 37,
	ID_CHL2_Player = 79,
	ID_CBaseHLBludgeonWeapon = 25,
	ID_CHLSelectFireMachineGun = 85,
	ID_CHLMachineGun = 84,
	ID_CBaseHelicopter = 20,
	ID_CNPC_Barney = 97,
	ID_CNPC_Barnacle = 96,
	ID_AR2Explosion = 0,
	ID_CTEAntlionDust = 149,
	ID_CBaseHLCombatWeapon = 26,
	ID_CWeaponHandGrenade = 218,
	ID_CBaseHL1MPCombatWeapon = 22,
	ID_CBaseHL1CombatWeapon = 21,
	ID_CAIWeaponAR2 = 3,
	ID_CAIWeaponShotgun = 8,
	ID_CAIWeaponCrossbow = 4,
	ID_CAIWeaponCrowbar = 5,
	ID_CAIWeaponRPG = 7,
	ID_CAIWeaponSMG1 = 9,
	ID_CAIWeaponPistol = 6,
	ID_CAIWeapon357 = 2,
	ID_CGMOD_Player = 76,
	ID_CAIWeaponStunStick = 10,
	ID_CFleshEffectTarget = 0,
	ID_CPropJeepEpisodic = 124,
	ID_CPropScalable = 125,
	ID_CNPC_Puppet = 100,
	ID_CHandleTest = 78,
	ID_CSpriteTrail = 145,
	ID_CSpriteOriented = 144,
	ID_CSprite = 143,
	ID_CRagdollPropAttached = 131,
	ID_CRagdollProp = 130,
	ID_CPredictedViewModel = 119,
	ID_CPoseController = 117,
	ID_CGameRulesProxy = 75,
	ID_CInfoLadderDismount = 86,
	ID_CFuncLadder = 68,
	ID_CEnvDetailController = 48,
	ID_CWorld = 229,
	ID_CWaterLODControl = 204,
	ID_CWaterBullet = 203,
	ID_CVoteController = 202,
	ID_CVGuiScreen = 199,
	ID_CPropJeep = 123,
	ID_CPropVehicleChoreoGeneric = 126,
	ID_CTest_ProxyToggle_Networkable = 196,
	ID_CTesla = 191,
	ID_CTeam = 148,
	ID_CSun = 147,
	ID_CParticlePerformanceMonitor = 105,
	ID_CSpotlightEnd = 142,
	ID_CSlideshowDisplay = 140,
	ID_CShadowControl = 139,
	ID_CSceneEntity = 134,
	ID_CRopeKeyframe = 132,
	ID_CRagdollManager = 129,
	ID_CPhysicsPropMultiplayer = 111,
	ID_CPhysBoxMultiplayer = 109,
	ID_CBasePropDoor = 29,
	ID_CDynamicProp = 43,
	ID_CPointCommentaryNode = 116,
	ID_CPointCamera = 115,
	ID_CPlayerResource = 114,
	ID_CPlasma = 113,
	ID_CPhysMagnet = 112,
	ID_CPhysicsProp = 110,
	ID_CPhysBox = 108,
	ID_CParticleSystem = 106,
	ID_CMaterialModifyControl = 93,
	ID_CLightGlow = 91,
	ID_CInfoOverlayAccessor = 88,
	ID_CFuncTrackTrain = 74,
	ID_CFuncSmokeVolume = 73,
	ID_CFuncRotating = 72,
	ID_CFuncReflectiveGlass = 71,
	ID_CFuncOccluder = 70,
	ID_CFuncMonitor = 69,
	ID_CFunc_LOD = 65,
	ID_CTEDust = 169,
	ID_CFunc_Dust = 64,
	ID_CFuncConveyor = 67,
	ID_CBreakableSurface = 36,
	ID_CFuncAreaPortalWindow = 66,
	ID_CFish = 60,
	ID_CEntityFlame = 46,
	ID_CFireSmoke = 58,
	ID_CEnvTonemapController = 56,
	ID_CEnvScreenEffect = 53,
	ID_CEnvScreenOverlay = 54,
	ID_CEnvProjectedTexture = 51,
	ID_CEnvParticleScript = 50,
	ID_CFogController = 63,
	ID_CEntityParticleTrail = 47,
	ID_CEntityDissolve = 45,
	ID_CDynamicLight = 42,
	ID_CColorCorrectionVolume = 39,
	ID_CColorCorrection = 38,
	ID_CBreakableProp = 35,
	ID_CBasePlayer = 28,
	ID_CBaseFlex = 18,
	ID_CBaseEntity = 17,
	ID_CBaseDoor = 16,
	ID_CBaseCombatCharacter = 14,
	ID_CBaseAnimatingOverlay = 13,
	ID_CBoneFollower = 33,
	ID_CBaseAnimating = 12,
	ID_CInfoLightingRelative = 87,
	ID_CAI_BaseNPC = 1,
	ID_CBeam = 32,
	ID_CBaseViewModel = 31,
	ID_CBaseParticleEntity = 27,
	ID_CBaseGrenade = 19,
	ID_CBaseCombatWeapon = 15,
	ID_CWeaponPhysGun = 222,
	ID_CPhysBeam = 107,
	ID_CLuaNextBot = 92,
	ID_CFlexManipulate = 62,
	ID_CBoneManipulate = 34,
	ID_CWeaponSWEP = 228,
	ID_CSENT_point = 138,
	ID_CSENT_anim = 137,
	ID_CSENT_AI = 136,
	ID_CGMODGameRulesProxy = 77
};

enum ButtonCode_t
{
	BUTTON_CODE_INVALID = -1,
	BUTTON_CODE_NONE = 0,

	KEY_FIRST = 0,

	KEY_NONE = KEY_FIRST,
	KEY_0,
	KEY_1,
	KEY_2,
	KEY_3,
	KEY_4,
	KEY_5,
	KEY_6,
	KEY_7,
	KEY_8,
	KEY_9,
	KEY_A,
	KEY_B,
	KEY_C,
	KEY_D,
	KEY_E,
	KEY_F,
	KEY_G,
	KEY_H,
	KEY_I,
	KEY_J,
	KEY_K,
	KEY_L,
	KEY_M,
	KEY_N,
	KEY_O,
	KEY_P,
	KEY_Q,
	KEY_R,
	KEY_S,
	KEY_T,
	KEY_U,
	KEY_V,
	KEY_W,
	KEY_X,
	KEY_Y,
	KEY_Z,
	KEY_PAD_0,
	KEY_PAD_1,
	KEY_PAD_2,
	KEY_PAD_3,
	KEY_PAD_4,
	KEY_PAD_5,
	KEY_PAD_6,
	KEY_PAD_7,
	KEY_PAD_8,
	KEY_PAD_9,
	KEY_PAD_DIVIDE,
	KEY_PAD_MULTIPLY,
	KEY_PAD_MINUS,
	KEY_PAD_PLUS,
	KEY_PAD_ENTER,
	KEY_PAD_DECIMAL,
	KEY_LBRACKET,
	KEY_RBRACKET,
	KEY_SEMICOLON,
	KEY_APOSTROPHE,
	KEY_BACKQUOTE,
	KEY_COMMA,
	KEY_PERIOD,
	KEY_SLASH,
	KEY_BACKSLASH,
	KEY_MINUS,
	KEY_EQUAL,
	KEY_ENTER,
	KEY_SPACE,
	KEY_BACKSPACE,
	KEY_TAB,
	KEY_CAPSLOCK,
	KEY_NUMLOCK,
	KEY_ESCAPE,
	KEY_SCROLLLOCK,
	KEY_INSERT,
	KEY_DELETE,
	KEY_HOME,
	KEY_END,
	KEY_PAGEUP,
	KEY_PAGEDOWN,
	KEY_BREAK,
	KEY_LSHIFT,
	KEY_RSHIFT,
	KEY_LALT,
	KEY_RALT,
	KEY_LCONTROL,
	KEY_RCONTROL,
	KEY_LWIN,
	KEY_RWIN,
	KEY_APP,
	KEY_UP,
	KEY_LEFT,
	KEY_DOWN,
	KEY_RIGHT,
	KEY_F1,
	KEY_F2,
	KEY_F3,
	KEY_F4,
	KEY_F5,
	KEY_F6,
	KEY_F7,
	KEY_F8,
	KEY_F9,
	KEY_F10,
	KEY_F11,
	KEY_F12,
	KEY_CAPSLOCKTOGGLE,
	KEY_NUMLOCKTOGGLE,
	KEY_SCROLLLOCKTOGGLE,

	KEY_LAST = KEY_SCROLLLOCKTOGGLE,
	KEY_COUNT = KEY_LAST - KEY_FIRST + 1,

	// Mouse
	MOUSE_FIRST = KEY_LAST + 1,

	MOUSE_LEFT = MOUSE_FIRST,
	MOUSE_RIGHT,
	MOUSE_MIDDLE,
	MOUSE_4,
	MOUSE_5,
	MOUSE_WHEEL_UP,		// A fake button which is 'pressed' and 'released' when the wheel is moved up 
	MOUSE_WHEEL_DOWN,	// A fake button which is 'pressed' and 'released' when the wheel is moved down

	MOUSE_LAST = MOUSE_WHEEL_DOWN,
	MOUSE_COUNT = MOUSE_LAST - MOUSE_FIRST + 1,
};
struct vrect_t
{
	int				x, y, width, height;
	vrect_t			*pnext;
};
class CViewSetup
{
public:

public:
	__int32 x; //0x0000 
	__int32 m_nUnscaledX; //0x0004 
	__int32 y; //0x0008 
	__int32 m_nUnscaledY; //0x000C 
	__int32 width; //0x0010 
	__int32 m_nUnscaledWidth; //0x0014 
	__int32 height; //0x0018 
	__int32 m_eStereoEye; //0x001C 
	__int32 m_nUnscaledHeight; //0x0020 
	__int32 m_bOrtho; //0x0024 
	float m_OrthoLeft; //0x0028 
	float m_OrthoTop; //0x002C 
	float m_OrthoRight; //0x0030 
	float m_OrthoBottom; //0x0034 
	float fov; //0x0038 
	float viewmodel_fov; //0x003C 
	Vector Origin; //0x0040 
	QAngle Angle; //0x004C 
	float zNear; //0x0058 
	float zFar; //0x005C 
	float zNearViewmodel; //0x0060 
	float zFarViewmodel; //0x0064 
	__int32 m_bRenderToSubrectOfLargerScreen; //0x0068 
	float m_flAspectRatio; //0x006C 
	__int32		m_bOffCenter;
	float		m_flOffCenterTop;
	float		m_flOffCenterBottom;
	float		m_flOffCenterLeft;
	float		m_flOffCenterRight;
	__int32		m_bDoBloomAndToneMapping;
	bool		m_bCacheFullSceneState;


	char _0x0058[168];
};
typedef float vec_t;
typedef int qboolean;
// Note: These flags need to match the bspfile.h DISPTRI_TAG_* flags.
#define DISPSURF_FLAG_SURFACE		(1<<0)
#define DISPSURF_FLAG_WALKABLE		(1<<1)
#define DISPSURF_FLAG_BUILDABLE		(1<<2)
#define DISPSURF_FLAG_SURFPROP1		(1<<3)
#define DISPSURF_FLAG_SURFPROP2		(1<<4)
struct cplane_t
{
	Vector	normal;
	float	dist;
	byte	type;			// for fast side tests
	byte	signbits;		// signx + (signy<<1) + (signz<<1)
	byte	pad[2];

#ifdef VECTOR_NO_SLOW_OPERATIONS
	cplane_t() {}

private:
	// No copy constructors allowed if we're in optimal mode
	cplane_t(const cplane_t& vOther);
#endif
};
// This structure is sent over the net to describe a screen fade event
struct ScreenFade_t
{
